app/controllers/texts_controller.rb

SELECT "texts".* FROM "texts"
---
  def index
    @texts = Text.all

INSERT INTO "texts" ("number", "message") VALUES ($1, $2) RETURNING "id"  [["number", "6175012003"], ["message", "Hello!"]]
---
  def create
      @text = Text.new(text_params)
      if @text.save